print( 1 + 1 )
if 4 in [1,2,3,4]: print("4가 있습니다")
'''
    파이썬이란?
        - 인터프리터 언어
        - 구글, 인스타, 넷플릭스, 아마존 등 기업에서 사용중
    파이썬 특징
        - '인간다운 언어'
            - if 4 in [1,2,3,4] : print ("4가 있습니다")
        - 문법이 상대적으로 쉬워 빠르게 배울 수 있다
        - 무료지만 강력하다
            - 오픈소스
            - 시스템, 하드웨어 등 복잡한 프로그램은 파이썬과 어울리지 않지만 다른 언어들과 융합 가능 ( JAVA + PYTHON 등 )
                - C로 구성된 라이브러리도 많다
        - 간결하다
            - 다른 언어 : {} 중괄호 사용한 코드 맞춤
                if ( a > 4 ) {
                    System.out.println("a가 4보다 크다.")
                }
            - Python : {} 없이 들여쓰기(tab)을 이용한 코드 맞춤
                if a > 4:
                    print("a가 4보다 크다.")
    파이썬의 활용처
        - 웹 프로그래밍
        - * 인공지능, 머신러닝 ( 텐서플로 등 )
        - 수치 연산 : NumPy
        - * 데이터 분석 : NumPy
        - 데이터베이스 : MySQL
        - 유틸리티 제작
        - GUI(화면) 프로그래밍
        - * C/C++ 결합
        - * 사물 인터넷 : 라즈베리파이
'''
